In [4]:
# Import Pandas module

import pandas as pd
import numpy as np

# CREATING DATAFRAMES
## OPTION 1

In [5]:
#With numpy we can create an array and then assigning values.
df2 = pd.DataFrame(np.array([[1, "Bob", 500.14], [2, "Amanda", 300.42], [3, "Jill", 943.54], [3, "Dylan", 112.53]]),
                   columns=["id", "name", "account_balance"])
df2

  id    name account_balance
0  1     Bob          500.14
1  2  Amanda          300.42
2  3    Jill          943.54
3  3   Dylan          112.53

## OPTION 2

In [6]:
# Creating a Pandas DataFrame by passing in a LIST OF DICTIONARIES
# Each value in the list is a dictionary
# Imagine that each dictionary represents a row of data in our eventual dataframe
# Each dictionary should have the same keys, since these keys dictate the column headers of our dataframe

my_list = [{"id": 1, "name": "Bob", "account_balance": 500.14},
           {"id": 2, "name": "Amanda", "account_balance": 300.42},
           {"id": 3, "name": "Jill", "account_balance": 943.54},
           {"id": 4, "name": "Dylan", "account_balance": 112.53}

my_df_1 = pd.DataFrame(my_list)
my_df_1

SyntaxError: invalid syntax (<ipython-input-6-e108a61e23d5>, line 11)

## Get the index of a specific column

In [7]:
df_series = pd.Series(my_df_1["id"])
df_series

NameError: name 'my_df_1' is not defined

## Jupyter solo deja imprimir una sola cosa, para imprimir multiples cosas usar:

In [8]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Mostrar los datos de una sola columna ºnotese la diferencia usando  [['name']] a ['name']º

In [9]:
df_name_like_df = my_df_1[['name']].head()
df_name_like_df

df_name_like_array = my_df_1['name'].head()
df_name_like_array

NameError: name 'my_df_1' is not defined

# Funciones
### Nuevo dataframe para exponer ejemplos

In [10]:
# Create a new DataFrame that represents purchase data from an online retailer

my_dict_2 = {"order_id": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
             "price": [13.50, 9.99, 12.00, 29.99, 
                       14.99, 7.99, 3.49, 10.00, 
                       9.99, 17.99, 20.00, 21.00, 14.99],
             "purchase_category": ["Apparel", "Sports", "Toys", 
                                   "Apparel", "Apparel", "Household", 
                                   "Household", "Toys", "Sports", 
                                   "Sports", "Apparel", "Household", "Apparel"],
             "clicked_ad": [True, True, False, True, False, 
                            True, True, False, False, True, 
                            True, True, False]}
purchase_df = pd.DataFrame(my_dict_2)
purchase_df

    order_id  price purchase_category  clicked_ad
0          1  13.50           Apparel        True
1          2   9.99            Sports        True
2          3  12.00              Toys       False
3          4  29.99           Apparel        True
4          5  14.99           Apparel       False
5          6   7.99         Household        True
6          7   3.49         Household        True
7          8  10.00              Toys       False
8          9   9.99            Sports       False
9         10  17.99            Sports        True
10        11  20.00           Apparel        True
11        12  21.00         Household        True
12        13  14.99           Apparel       False

**.describe( )** se usa cuando quieres sacar todos los valores numericos ºpromedio, std, count, etc..º

In [11]:
all_numeric_data = purchase_df.describe()
all_numeric_data

       order_id      price
count  13.00000  13.000000
mean    7.00000  14.301538
std     3.89444   6.809116
min     1.00000   3.490000
25%     4.00000   9.990000
50%     7.00000  13.500000
75%    10.00000  17.990000
max    13.00000  29.990000

**.value_counts()** returns an array containing the # of times each unique value occurs in a given column

In [12]:
category_df_count = purchase_df["purchase_category"].value_counts()
category_df_count

Apparel      5
Household    3
Sports       3
Toys         2
Name: purchase_category, dtype: int64

**.unique()** returns an array of all of the unique values within a given column

In [1]:
unique_pcat = purchase_df["purchase_category"].unique()
print(unique_pcat)
print(unique_pcat[2])

NameError: name 'purchase_df' is not defined

**.sum() and .mean()**

In [82]:
mean_price = purchase_df["price"].mean()
sum_order_id = purchase_df["order_id"].sum()

"promedio: " + str(mean_price)
"suma: " + str(sum_order_id)
mean_price + sum_order_id

'promedio: 14.30153846153846'

'suma: 91'

105.30153846153846